---
kind: other
id: Methods.T:Autodesk.Revit.DB.WorksetDefaultVisibilitySettings
source: html/3c48aa26-7f9e-7779-a28e-31ef5cb17084.htm
---
# WorksetDefaultVisibilitySettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.